breksos/ASL-TRANSLATOR-GLOVE/firmware/idf/asl_csv_logger/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y

# CSV at 6 * 50 Hz needs the high baud or we drop bytes.
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Quiet the IDF logger so its output doesn't interleave with CSV rows.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2
